/*
// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3

Console.Writ("Input integer number 5 or 7: ");
int num a = 5;
int num b = 7;
if (num a)
   Console.WriteLine("Result min number is ");
else (num b)
   Console.WriteLine("Result max number is "); 

   */